Revit 2024 API
Rebar.GetReinforcementRoundingManager Method
 Returns an object for managing reinforcement rounding override settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public RebarRoundingManager GetReinforcementRoundingManager()
Visual Basic
Public Function GetReinforcementRoundingManager As RebarRoundingManager
Visual C++
public:
RebarRoundingManager^ GetReinforcementRoundingManager()
Return Value
 The rounding manager.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace